# Terraform environment test
#### Format and Style 🖌`failure`
#### Initialization ⚙️`success`
#### Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Plan 📖`success`

<details><summary>Show Plan</summary>

```

[Lines containing Refreshing state removed]
[Maybe further truncated see logs for complete plan output]
Acquiring state lock. This may take a few moments...
data.azurerm_client_config.current: Reading...
data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1mMDNmNzU3OS01ZjM5LTRkN2YtYmNlYS04ZTVjYjZkN2FjYTQ7b2JqZWN0SWQ9MDJiMTdkMjgtN2VjOC00MDg0LTkyY2UtZDI2MDUxZmE0OTk4O3N1YnNjcmlwdGlvbklkPTFjZThlOWFmLWMyZDYtNDRlNy05YzVlLTA5OWEzMDgwNTZmZTt0ZW5hbnRJZD1jZDAwMjZkOC0yODNiLTRhNTUtOWJmYS1kMGVmNGE4YmEyMWM=]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_application_insights.app will be created
  + resource "azurerm_application_insights" "app" {
      + app_id                              = (known after apply)
      + application_type                    = "web"
      + connection_string                   = (sensitive value)
      + daily_data_cap_in_gb                = 100
      + disable_ip_masking                  = true
      + force_customer_storage_for_profiler = false
      + id                                  = (known after apply)
      + instrumentation_key                 = (sensitive value)
      + internet_ingestion_enabled          = true
      + internet_query_enabled              = true
      + local_authentication_disabled       = false
      + location                            = "norwayeast"
      + name                                = "altinn-monitor-test-insights"
      + resource_group_name                 = "altinn-monitor-test-rg"
      + retention_in_days                   = 30
      + sampling_percentage                 = 100
      + workspace_id                        = (known after apply)
    }

  # azurerm_log_analytics_workspace.application will be created
  + resource "azurerm_log_analytics_workspace" "application" {
      + allow_resource_only_permissions = true
      + daily_quota_gb                  = -1
      + id                              = (known after apply)
      + internet_ingestion_enabled      = true
      + internet_query_enabled          = true
      + local_authentication_disabled   = false
      + location                        = "norwayeast"
      + name                            = "altinn-monitor-test-law"
      + primary_shared_key              = (sensitive value)
      + resource_group_name             = "altinn-monitor-test-rg"
      + retention_in_days               = 30
      + secondary_shared_key            = (sensitive value)
      + sku                             = (known after apply)
      + workspace_id                    = (known after apply)

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }
    }

  # azurerm_role_assignment.log_analytics_reader will be created
  + resource "azurerm_role_assignment" "log_analytics_reader" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "/subscriptions/1ce8e9af-c2d6-44e7-9c5e-099a308056fe/resourceGroups/altinn-monitor-test-rg/providers/Microsoft.Dashboard/grafana/altinn-grafana-test"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Log Analytics Reader"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = true
    }

  # azurerm_role_assignment.operations_altinn_law_reader["143ed28a-6e6d-4ca0-8273-eecb9c1665ba"] will be created
  + resource "azurerm_role_assignment" "operations_altinn_law_reader" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "143ed28a-6e6d-4ca0-8273-eecb9c1665ba"
      + principal_type                   = "Group"
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Log Analytics Reader"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = true
    }

  # azurerm_role_assignment.operations_altinn_law_reader["5a5ed585-9f7c-4b94-80af-9ceee8124db3"] will be created
  + resource "azurerm_role_assignment" "operations_altinn_law_reader" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "5a5ed585-9f7c-4b94-80af-9ceee8124db3"
      + principal_type                   = "Group"
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Log Analytics Reader"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = true
    }

  # azurerm_role_assignment.operations_altinn_monitoring_contributor["143ed28a-6e6d-4ca0-8273-eecb9c1665ba"] will be created
  + resource "azurerm_role_assignment" "operations_altinn_monitoring_contributor" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "143ed28a-6e6d-4ca0-8273-eecb9c1665ba"
      + principal_type                   = "Group"
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Monitoring Contributor"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = true
    }

  # azurerm_role_assignment.operations_altinn_monitoring_contributor["5a5ed585-9f7c-4b94-80af-9ceee8124db3"] will be created
  + resource "azurerm_role_assignment" "operations_altinn_monitoring_contributor" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "5a5ed585-9f7c-4b94-80af-9ceee8124db3"
      + principal_type                   = "Group"
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Monitoring Contributor"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = true
    }

Plan: 7 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan.out

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan.out"
Releasing state lock. This may take a few moments...

```

</details>

| Context | Values |
| - | - |
| Pusher | @sduranc |
| Action | `pull_request` |
| Working Directory | `./infrastructure/adminservices-test/altinn-monitor-test-rg` |
| State File | `github.com/altinn/altinn-platform/environments/test/altinn-monitor-test-rg.tfstate` |
| Plan File | `github.com_altinn_altinn-platform_environments_test_altinn-monitor-test-rg.tfstate.tfplan`